tap "homebrew/bundle"
tap "homebrew/services"
brew "arp-scan"
brew "cmake"
brew "git-lfs"
brew "openssl@3"
brew "libfido2"
brew "lua"
brew "mysql", restart_service: true
brew "pcre2"
brew "nmap"
brew "node"
brew "redis", restart_service: true
brew "stockfish"
brew "wifi-password"
cask "mactex-no-gui"
vscode "amazonwebservices.aws-toolkit-vscode"
vscode "donjayamanne.jquerysnippets"
vscode "github.copilot"
vscode "github.copilot-chat"
vscode "github.copilot-labs"
vscode "james-yu.latex-workshop"
vscode "kdarkhan.mips"
vscode "martinring.smt-lib-syntax"
vscode "monokai.theme-monokai-pro-vscode"
vscode "ms-azuretools.vscode-docker"
vscode "ms-python.debugpy"
vscode "ms-python.isort"
vscode "ms-python.python"
vscode "ms-python.vscode-pylance"
vscode "ms-toolsai.jupyter"
vscode "ms-toolsai.jupyter-keymap"
vscode "ms-toolsai.jupyter-renderers"
vscode "ms-toolsai.vscode-jupyter-cell-tags"
vscode "ms-toolsai.vscode-jupyter-slideshow"
vscode "ms-vscode-remote.remote-containers"
vscode "ms-vscode-remote.remote-ssh"
vscode "ms-vscode-remote.remote-ssh-edit"
vscode "ms-vscode.cmake-tools"
vscode "ms-vscode.cpptools"
vscode "ms-vscode.cpptools-extension-pack"
vscode "ms-vscode.cpptools-themes"
vscode "ms-vscode.remote-explorer"
vscode "ms-vsliveshare.vsliveshare"
vscode "ms-vsliveshare.vsliveshare-pack"
vscode "mshr-h.veriloghdl"
vscode "notskm.clang-tidy"
vscode "redhat.java"
vscode "reditorsupport.r"
vscode "stephanvs.dot"
vscode "twxs.cmake"
vscode "visualstudioexptteam.intellicode-api-usage-examples"
vscode "visualstudioexptteam.vscodeintellicode"
vscode "vscjava.vscode-java-debug"
vscode "vscjava.vscode-java-dependency"
vscode "vscjava.vscode-java-pack"
vscode "vscjava.vscode-java-test"
vscode "vscjava.vscode-maven"
vscode "whizkydee.material-palenight-theme"
vscode "xaver.clang-format"
